RSN/src/InformationRegisters/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.ЗаявкиНаПредоставлениеДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ЗаявкиНаСогласовании/ЗаявкиНаСогласовании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиНаСогласовании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>Гуид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.ЗаявкиНаПредоставлениеДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Создано</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВТесте</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтзыва</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>НаПаузе</name>
  </enumValues>
  <enumValues>
    <name>Отозвано</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеУточнений</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>ОтказаноВСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаВыполнения</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/ЗаявкиНаПредоставлениеДоступа/ЗаявкиНаПредоставлениеДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкиНаПредоставлениеДоступа</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>EnumRef.ПриоритетыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>АдерсЭлПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиРассылки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доступы</name>
    <attributes>
      <name>ИБ</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступыГруппы</name>
    <attributes>
      <name>ИБ</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ГруппыПрофилей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/CommonModules/УправлениеСтатусами/Module.bsl
#Область Интерфейс

#Область МаршрутыЗаявкаНаПраваДоступа
Функция ПолучитьСледующийШаг(ТекущийШаг = Неопределено) Экспорт
	Если ЗначениеЗаполнено(ТекущийШаг) = Ложь Тогда 
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано"));
	КонецЕсли;
	
	Ответ = Новый Массив;
	
	Если ТекущийШаг = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано") Тогда 
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НаСогласовании"));
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отозвано"));
	ИначеЕсли ТекущийШаг = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НаСогласовании") Тогда
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано"));
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласовано"));
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтказаноВСогласовании"));
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отозвано"));
	ИначеЕсли ТекущийШаг = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласовано") Тогда 
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ВРаботе"));
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отозвано"));
	ИначеЕсли ТекущийШаг = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ВРаботе") Тогда 
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Завершено"));
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОшибкаВыполнения"));
		Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отозвано"));
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ВыполнитьПостобработчик(Заявка, ТекущийШаг) Экспорт    
	Если ТекущийШаг = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.НаСогласовании") Тогда  
		Результат = ОтправитьНаСогласование(Заявка); 
	ИначеЕсли ТекущийШаг = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано") Тогда  
		Результат = ОтменитьСогласование(Заявка);                                                            
	ИначеЕсли ТекущийШаг = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласовано") Тогда 
		//Результат = ОтработатьСогласовано(Заявка);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Служебные 
Функция ОтработатьСогласовано(Заявка) Экспорт 
	Результат = Справочники.ЗаявкиНаПредоставлениеДоступа.ВыдатьПраваПоЗаявке(Заявка); 
	Если Результат.ЕстьОшибка Тогда 
		РегистрыСведений.СтатусыЗаявок.УстановитьСтатус(Заявка, ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОшибкаВыполнения"));
		Шаблон = "Заявка %1, описание: %2";
		
		СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий,ДатаСобытия");
		СтруктураСобытий.ИмяСобытия 		 = "ЗаявкаНПД.ВыдатьПрава";
		СтруктураСобытий.ПредставлениеУровня = "Ошибка";	//"Информация", "Ошибка", "Предупреждение", "Примечание".
		СтруктураСобытий.Комментарий 		 = СтрШаблон(Шаблон, Строка(Заявка), Результат.ОписаниеОшибки);
		
		События = Новый СписокЗначений;
		События.Добавить(СтруктураСобытий);
		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(События);
	Иначе 
		РегистрыСведений.СтатусыЗаявок.УстановитьСтатус(Заявка, ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Завершено"));
	КонецЕсли;
	
	Возврат Результат
КонецФункции

Функция ОтменитьСогласование(Заявка) Экспорт   
	Возврат РегистрыСведений.ЗаявкиНаСогласовании.ОтменитьСогласование(Заявка);
КонецФункции

Функция ОтправитьНаСогласование(Заявка) Экспорт   
	Ответ = Новый Структура("Результат, ОписаниеОшибки, ЕстьОшибка", Ложь, "", Ложь);  
	
	МассивСогласющих = РегистрыСведений.УчастникиПочтовойРассылки.ПолучитьСогласующих();
	
	СтруктураПисьма = Справочники.ЗаявкиНаПредоставлениеДоступа.ПолучитьСтруктуруПисьма();
	СтруктураПисьма.МассивАдресов 	= МассивСогласющих;
	СтруктураПисьма.ШаблонТема 		= "Требуется согласование доступа, заявка {Код} от {ДатаЗаявки}";
	//СтруктураПисьма.ШаблонТело 		= "Заявка [Код] от [ДатаЗаявки]";    
	Гуид = Новый УникальныйИдентификатор;
	СтруктураПисьма.ШаблонТело 		= ПолучитьШаблонТелоСогласовано(Гуид);//"Заявка [Код] от [ДатаЗаявки]";
	//СтруктураПисьма.ДопПараметры = Новый Структура("Статус", НовыйСтатус);
	
	Результат = Справочники.ЗаявкиНаПредоставлениеДоступа.ОтправитьПисьмо(Заявка, СтруктураПисьма);
	
	//Результат = Взаимодействия.СоздатьПисьмо(Сообщение, УЗ);
	
	Если Результат.ЕстьОшибка Тогда 
		//ОбщегоНазначения.СообщитьПользователю("Письмо не создано/не отправлено: " + Результат.ОписаниеОшибки);
		//
		//Ответ.ЕстьОшибка 	 = Истина;
		//Ответ.ОписаниеОшибки = Результат.ОписаниеОшибки;
		Возврат Ответ;
	КонецЕсли; 
	
	//Установим признак согласования 
	Структура = Новый Структура("Заявка,Письмо");//, Заявка,Результат.СсылкаНаПисьмо);
	ЗаполнитьЗначенияСвойств(Структура, Результат.Результат);
	Структура.Вставить("Гуид", Гуид);
	
	Возврат РегистрыСведений.ЗаявкиНаСогласовании.ОтправитьНаСогласование(Структура);
КонецФункции  

Функция ПолучитьШаблонТелоСогласовано(Гуид)
	ТегСогласовано     = "[APPROVED][ID=" + Строка(Гуид) + "]";
	ТегНеСогласовано   = "[REJECTED][ID=" + Строка(Гуид) + "]";
	
	//ТемаСогласовано    = ТегСогласовано;
	//ТемаНеСогласовано  = ТегНеСогласовано;
	//
	//ТелоСогласовано =
	//ТегСогласовано + Символы.ПС
	//+ "Согласовано." + Символы.ПС
	//+ "ID письма: " + ИдентификаторПисьма;
	//
	//ТелоНеСогласовано =
	//ТегНеСогласовано + Символы.ПС
	//+ "Не согласовано." + Символы.ПС
	//+ "ID письма: " + ИдентификаторПисьма;
	АдресОтвета = "{АдресОтвета}";
	СсылкаСогласовано =
	"mailto:" + АдресОтвета
	+ "?subject=" + URLКодироватьUTF8(ТегСогласовано)
	+ "&body="    + URLКодироватьUTF8(ТегСогласовано);
	//+ "?subject=" + (ТегСогласовано)
	//+ "&body="    + (ТегСогласовано);
	
	СсылкаНеСогласовано =
	"mailto:" + АдресОтвета
	+ "?subject=" + URLКодироватьUTF8(ТегНеСогласовано)
	+ "&body="    + URLКодироватьUTF8(ТегНеСогласовано);
	
	HTML =
	"<div style='font-family:Arial,sans-serif;font-size:14px;'>" +
	"  <p style='margin:0 0 12px 0;'><b>Пожалуйста, выберите действие:</b></p>" +
	"  <table role='presentation' cellpadding='0' cellspacing='0' border='0'>" +
	"    <tr>" +
	"      <td bgcolor='#2e7d32' style='border-radius:4px;'>" +
	"        <a href='" + СсылкаСогласовано + "' " +
	"           style='display:inline-block;" +
	"                  padding:10px 18px;" +
	"                  font-family:Arial,sans-serif;" +
	"                  font-size:14px;" +
	"                  font-weight:bold;" +
	"                  color:#ffffff;" +
	"                  text-decoration:none;" +
	"                  background:#2e7d32;" +
	"                  border:1px solid #1b5e20;" +
	"                  border-radius:4px;'>" +
	"          Согласовано" +
	"        </a>" +
	"      </td>" +
	"      <td style='width:10px;font-size:0;line-height:0;'>&nbsp;</td>" +
	"      <td bgcolor='#c62828' style='border-radius:4px;'>" +
	"        <a href='" + СсылкаНеСогласовано + "' " +
	"           style='display:inline-block;" +
	"                  padding:10px 18px;" +
	"                  font-family:Arial,sans-serif;" +
	"                  font-size:14px;" +
	"                  font-weight:bold;" +
	"                  color:#ffffff;" +
	"                  text-decoration:none;" +
	"                  background:#c62828;" +
	"                  border:1px solid #8e0000;" +
	"                  border-radius:4px;'>" +
	"          Не согласовано" +
	"        </a>" +
	"      </td>" +
	"    </tr>" +
	"    <tr>" +
	"      <td colspan='3' height='12' style='height:12px;line-height:12px;font-size:0;'>&nbsp;</td>" +
	"    </tr>" +
	"  </table>" +
	"  <p style='margin:0;color:#666666;font-size:12px;'>" +
	"    Если кнопки не сработали, просто ответьте на письмо, сохранив тег в теме. Напишите в ответе 'согласовано' или 'не согласовано'." +
	"  </p>" +
	"</div>";
	
	Возврат HTML;
КонецФункции  

Функция URLКодироватьUTF8(Значение) Экспорт
	Возврат КодироватьСтроку(Значение, СпособКодированияСтроки.КодировкаURL, "UTF-8");
КонецФункции

#КонецОбласти

#КонецОбласти
